canal_base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 0.001;

vertices
(
${vertex_list}
);

blocks
(
    hex (0 4 6 2 1 5 7 3)
    (${mesh_sizes_block1})
    simpleGrading (1 0.1 1)

    hex (4 8 10 6 5 9 11 7)
    (${mesh_sizes_block2})
    simpleGrading (1 0.1 1)

    hex (8 12 14 10 9 13 15 11)
    (${mesh_sizes_block3})
    simpleGrading (1 0.1 1)

    hex (10 14 18 16 11 15 19 17)
    (${mesh_sizes_block4})
    simpleGrading (1 10 1)

    hex (9 13 15 11 20 22 23 21)
    (${mesh_sizes_block5})
    simpleGrading (1 0.1 1)

    hex (11 15 19 17 21 23 25 24)
    (${mesh_sizes_block6})
    simpleGrading (1 10 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
            (14 15 19 18)
            (13 15 23 22)
            (15 19 25 23)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (0 2 4 6)
            (4 6 8 10)
            (8 10 12 14)
            (10 16 18 14)
        );
    }
    back
    {
        type wall;
        faces
        (
            (1 3 5 7)
            (5 7 9 11)
            (20 21 23 22)
            (21 23 25 24)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 4 5)
            (4 5 8 9)
            (8 9 12 13)
            (9 13 22 20)
        );
    }
    walls
    {
        type    wall;
        faces
        (
            (2 3 6 7)
            (6 7 10 11)
            (10 11 17 16)
            (11 21 20 9)
            (11 17 24 21)
            (16 17 19 18)
            (17 19 25 24)
        );
    }
);

// ************************************************************************* //
